google.charts.load("current", { packages: ["corechart", "bar"] });
google.charts.setOnLoadCallback(drawChart);
url =
  "https://docs.google.com/spreadsheets/d/1VVqsn59eJWT4wIIINatcV5EBVHHEQzxS9Xm2We9wC9c/gviz/tq?sheet=data1&headers=1&tq=";
url2 =
  "https://docs.google.com/spreadsheets/d/1VVqsn59eJWT4wIIINatcV5EBVHHEQzxS9Xm2We9wC9c/gviz/tq?sheet=data2&headers=1&tq=";
url3 =
  "https://docs.google.com/spreadsheets/d/1VVqsn59eJWT4wIIINatcV5EBVHHEQzxS9Xm2We9wC9c/gviz/tq?sheet=data3&headers=1&tq=";
function drawChart() {
  chart1Draw();
  chart2Year59();
  chart3Draw();
  /*var queryString = encodeURIComponent("select A,B");
  var query1 = new google.visualization.Query(url + queryString);
  query1.send(handleChart1Response);
  */
  /*queryString = encodeURIComponent(
    "select A, sum(B), C where C=2559 group by A, C order by sum(B) desc"
  );
  var query2 = new google.visualization.Query(url2 + queryString);
  query2.send(handleChart2Response);*/
  /*
  queryString = encodeURIComponent("select A, B, C, D, E");
  var query3 = new google.visualization.Query(url3 + queryString);
  query3.send(handleChart3Response);
  */
}

function errorAlert(res) {
  alert("Error in query: " + res.getMessage() + " " + res.getDetailedMessage());
}

function chart2Year59() {
  console.log(59);
  var data = [
    ["agc", "budget"],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 185020300],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 270618800],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      275353500
    ],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 329458300],
    ["สำนักงานปรมาณูเพื่อสันติ", 284296500],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 568578300],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 3081089800],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 403702900],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 538094100],
    ["กรมวิทยาศาสตร์บริการ", 450267300],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 2849268000],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 489926200]
  ];
  chart2Draw(data);
}

function chart2Year60() {
  console.log(60);
  var data = [
    ["agc", "budget"],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 262112400],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 202253000],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      310963900
    ],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 313367500],
    ["สำนักงานปรมาณูเพื่อสันติ", 413526500],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 589030500],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 3404941600],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 440317000],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 585792400],
    ["กรมวิทยาศาสตร์บริการ", 474408400],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 4042756300],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 475781100]
  ];
  chart2Draw(data);
}

function chart2Year61() {
  console.log(61);
  data = [
    ["agc", "budget"],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 341251800],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 571682200],
    ["สำนักงานปรมาณูเพื่อสันติ", 268303500],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 382640700],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 692166500],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 507296000],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 3936577400],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 1809464800],
    ["กรมวิทยาศาสตร์บริการ", 524971800],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      302407700
    ],
    ["สถาบันมาตรวิทยาแห่งชาติ", 725870100],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 634137200],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 3578613100]
  ];
  chart2Draw(data);
}

function chart2Year62() {
  console.log(62);
  data = [
    ["agc", "budget"],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 277737800],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 376758100],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 343664200],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      1145009700
    ],
    ["สถาบันมาตรวิทยาแห่งชาติ", 480901300],
    ["สำนักงานปรมาณูเพื่อสันติ", 421357100],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 1388425400],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 832769800],
    ["กรมวิทยาศาสตร์บริการ", 548052700],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 450001900],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 4457888800],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 3314121500],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 690915400]
  ];
  chart2Draw(data);
}

function chart1Draw() {
  //var data = response.getDataTable();
  var data = google.visualization.arrayToDataTable([
    ["month", "gf_amount"],
    ["2004-10", 541.44],
    ["2004-11", 812.51],
    ["2004-12", 104.39],
    ["2005-1", 249.13],
    ["2005-2", 230.26],
    ["2005-3", 1741.7],
    ["2005-4", 101.55],
    ["2005-5", 738.26],
    ["2005-6", 174.13],
    ["2005-7", 602.05],
    ["2005-8", 379.84],
    ["2005-9", 147.93],
    ["2005-10", 1319.32],
    ["2005-11", 1397.84],
    ["2005-12", 135.09],
    ["2006-1", 1281.95],
    ["2006-2", 710.4],
    ["2006-3", 154.47],
    ["2006-4", 1375.41],
    ["2006-5", 1510.09],
    ["2006-6", 168.59],
    ["2006-7", 787.39],
    ["2006-8", 129.1],
    ["2006-9", 227.08],
    ["2006-10", 664.69],
    ["2006-11", 780.38],
    ["2006-12", 443.64],
    ["2007-1", 167.03],
    ["2007-2", 1812.35],
    ["2007-3", 677.08],
    ["2007-4", 463.14],
    ["2007-5", 1238.14],
    ["2007-6", 213.53],
    ["2007-7", 631.45],
    ["2007-8", 1591.61],
    ["2007-9", 365.63],
    ["2007-10", 806.2],
    ["2007-11", 1508.28],
    ["2007-12", 99.72],
    ["2008-1", 389.22],
    ["2008-2", 1150.98],
    ["2008-3", 121.99],
    ["2008-4", 298.08],
    ["2008-5", 1124.61],
    ["2008-6", 961.9],
    ["2008-7", 318.54],
    ["2008-8", 674.68],
    ["2008-9", 155.6],
    ["2008-10", 27.04],
    ["2008-11", 1503.43],
    ["2008-12", 931.77],
    ["2009-1", 198.42],
    ["2009-2", 1112.3],
    ["2009-3", 353.59],
    ["2009-4", 245.62],
    ["2009-5", 990.88],
    ["2009-6", 866.86],
    ["2009-7", 784.65],
    ["2009-8", 222.06],
    ["2009-9", 205.11],
    ["2009-10", 77.7],
    ["2009-11", 237.54],
    ["2009-12", 1693.71],
    ["2010-1", 671.95],
    ["2010-2", 955.78],
    ["2010-3", 71.52],
    ["2010-4", 145.91],
    ["2010-5", 1866.63],
    ["2010-6", 149.72],
    ["2010-7", 190.0],
    ["2010-8", 656.0],
    ["2010-9", 177.0],
    ["2010-10", 1484.79],
    ["2010-11", 1855.14],
    ["2010-12", 74.33],
    ["2011-1", 1085.26],
    ["2011-2", 180.84],
    ["2011-3", 189.23],
    ["2011-4", 1070.78],
    ["2011-5", 137.76],
    ["2011-6", 130.89],
    ["2011-7", 835.75],
    ["2011-8", 842.93],
    ["2011-9", 216.12],
    ["2011-10", 211.24],
    ["2011-11", 851.42],
    ["2011-12", 590.1],
    ["2012-1", 670.61],
    ["2012-2", 547.85],
    ["2012-3", 2175.61],
    ["2012-4", 381.65],
    ["2012-5", 957.95],
    ["2012-6", 70.52],
    ["2012-7", 749.75],
    ["2012-8", 429.88],
    ["2012-9", 132.54],
    ["2012-10", 1673.78],
    ["2012-11", 1253.35],
    ["2012-12", 85.74],
    ["2013-1", 1379.82],
    ["2013-2", 91.38],
    ["2013-3", 1016.0],
    ["2013-4", 168.96],
    ["2013-5", 892.64],
    ["2013-6", 780.25],
    ["2013-7", 278.41],
    ["2013-8", 261.74],
    ["2013-9", 593.98],
    ["2013-10", 1781.99],
    ["2013-11", 1525.82],
    ["2013-12", 1678.05],
    ["2014-1", 276.36],
    ["2014-2", 296.3],
    ["2014-3", 172.41],
    ["2014-4", 404.04],
    ["2014-5", 231.63],
    ["2014-6", 978.85],
    ["2014-7", 472.18],
    ["2014-8", 136.89],
    ["2014-9", 311.95],
    ["2014-10", 3615.03],
    ["2014-11", 1092.18],
    ["2014-12", 139.27],
    ["2015-1", 452.78],
    ["2015-2", 88.95],
    ["2015-3", 1166.3],
    ["2015-4", 619.72],
    ["2015-5", 751.74],
    ["2015-6", 278.26],
    ["2015-7", 185.65],
    ["2015-8", 145.82],
    ["2015-9", 142.64],
    ["2015-10", 4269.99],
    ["2015-11", 58.32],
    ["2015-12", 1135.41],
    ["2016-1", 272.81],
    ["2016-2", 73.98],
    ["2016-3", 1425.44],
    ["2016-4", 504.26],
    ["2016-5", 232.05],
    ["2016-6", 952.01],
    ["2016-7", 156.6],
    ["2016-8", 110.15],
    ["2016-9", 195.61],
    ["2016-10", 3182.43],
    ["2016-11", 994.13],
    ["2016-12", 969.27],
    ["2017-1", 329.53],
    ["2017-2", 165.92],
    ["2017-3", 932.43],
    ["2017-4", 1451.47],
    ["2017-5", 1498.91],
    ["2017-6", 471.2],
    ["2017-7", 577.08],
    ["2017-8", 161.14],
    ["2017-9", 175.88],
    ["2017-10", 5224.78],
    ["2017-11", 985.31],
    ["2017-12", 798.45],
    ["2018-1", 417.68],
    ["2018-2", 443.05],
    ["2018-3", 975.99],
    ["2018-4", 1914.59],
    ["2018-5", 393.5],
    ["2018-6", 427.27],
    ["2018-7", 1837.41],
    ["2018-8", 289.09],
    ["2018-9", 363.69],
    ["2018-10", 4302.45],
    ["2018-11", 1574.13],
    ["2018-12", 285.84],
    ["2019-1", 4602.06],
    ["2019-2", 358.3],
    ["2019-3", 195.95],
    ["2019-4", 110.87],
    ["2019-5", 17.17]
  ]);
  var options = {
    width: "80%",
    height: 300,
    legend: { position: "none" },
    vAxis: {
      viewWindow: {
        min: 0
      }
    }
  };
  var chart1 = new google.visualization.LineChart(
    document.getElementById("chart1")
  );
  chart1.draw(data, google.charts.Bar.convertOptions(options));
}

function chart2Draw(data) {
  var data = google.visualization.arrayToDataTable(data);
  data.sort({column:1,desc:true});
  var options = {
    width: "100%",
    height: 600,
    sliceVisibilityThreshold: 0.03,
    legend: { position: "right" }
  };
  var chart2 = new google.visualization.PieChart(
    document.getElementById("chart2")
  );
  chart2.draw(data, options);
}

function chart3Draw() {
  var data = google.visualization.arrayToDataTable([
    ["กรมในสังกัด", "ปี 2559", "ปี 2560", "ปี 2561", "ปี 2562"],
    ["กรมวิทยาศาสตร์บริการ", 450.2673, 474.4084, 524.9718, 548.0527],
    [
      "ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)",
      185.0203,
      262.1124,
      382.6407,
      277.7378
    ],
    [
      "สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)",
      538.0941,
      585.7924,
      692.1665,
      832.7698
    ],
    ["สถาบันมาตรวิทยาแห่งชาติ", 0, 0, 725.8701, 480.9013],
    [
      "สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)",
      403.7029,
      440.317,
      507.296,
      450.0019
    ],
    [
      "สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)",
      489.9262,
      475.7811,
      634.1372,
      690.9154
    ],
    [
      "สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)",
      329.4583,
      313.3675,
      571.6822,
      376.7581
    ],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      284.2965,
      310.9639,
      302.4077,
      1145.0097
    ],
    [
      "สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)",
      2849.268,
      202.253,
      341.2518,
      343.6642
    ],
    ["สำนักงานปรมาณูเพื่อสันติ", 3081.0898, 413.5265, 268.3035, 421.3571],
    [
      "สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี",
      275.3535,
      4042.7563,
      3578.6131,
      3314.1215
    ],
    [
      "สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)",
      270.6188,
      589.0305,
      1809.4648,
      1388.4254
    ],
    [
      "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ",
      568.5783,
      3404.9416,
      3936.5774,
      4457.8888
    ]
  ]);
  data.sort({column:4, desc:true})
  var chart3 = new google.visualization.BarChart(
    document.getElementById("chart3")
  );
  var options = {
    width: "100%",
    height: 900,
    bars: "horizontal"
  };

  chart3.draw(data, options);
}
