google.charts.load("current", { packages: ["corechart", "bar"] });
google.charts.setOnLoadCallback(drawChart);
function drawChart() {
  chart1Draw();
  chart2Year59();
  chart3Draw();
}

function chart2Year59() {
  console.log(59);
  var data = [
    ["agc", "budget"],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 185020300],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 270618800],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      275353500
    ],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 329458300],
    ["สำนักงานปรมาณูเพื่อสันติ", 284296500],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 568578300],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 3081089800],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 403702900],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 538094100],
    ["กรมวิทยาศาสตร์บริการ", 450267300],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 2849268000],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 489926200]
  ];
  chart2Draw(data);
}

function chart2Year60() {
  console.log(60);
  var data = [
    ["agc", "budget"],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 262112400],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 202253000],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      310963900
    ],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 313367500],
    ["สำนักงานปรมาณูเพื่อสันติ", 413526500],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 589030500],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 3404941600],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 440317000],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 585792400],
    ["กรมวิทยาศาสตร์บริการ", 474408400],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 4042756300],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 475781100]
  ];
  chart2Draw(data);
}

function chart2Year61() {
  console.log(61);
  data = [
    ["agc", "budget"],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 341251800],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 571682200],
    ["สำนักงานปรมาณูเพื่อสันติ", 268303500],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 382640700],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 692166500],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 507296000],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 3936577400],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 1809464800],
    ["กรมวิทยาศาสตร์บริการ", 524971800],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      302407700
    ],
    ["สถาบันมาตรวิทยาแห่งชาติ", 725870100],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 634137200],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 3578613100]
  ];
  chart2Draw(data);
}

function chart2Year62() {
  console.log(62);
  data = [
    ["agc", "budget"],
    ["ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)", 277737800],
    ["สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)", 376758100],
    ["สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)", 343664200],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      1145009700
    ],
    ["สถาบันมาตรวิทยาแห่งชาติ", 480901300],
    ["สำนักงานปรมาณูเพื่อสันติ", 421357100],
    ["สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)", 1388425400],
    ["สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)", 832769800],
    ["กรมวิทยาศาสตร์บริการ", 548052700],
    ["สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)", 450001900],
    ["สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ", 4457888800],
    ["สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี", 3314121500],
    ["สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน)", 690915400]
  ];
  chart2Draw(data);
}

function chart1Draw() {
  //var data = response.getDataTable();
  var data = google.visualization.arrayToDataTable([
    ["year","budget","use"],
    ["2005",6671.861,5823.194],
    ["2006",9995.387,9196.732],
    ["2007",9803.839,9048.668],
    ["2008",8349.971,7609.802],
    ["2009",8026.798,7441.723],
    ["2010",7159.701,6893.437],
    ["2011",8746.705,8103.801],
    ["2012",8052.295,7769.115],
    ["2013",8830.785,8476.033],
    ["2014",8763.589,8266.451],
    ["2015",8896.502,8678.322],
    ["2016",9725.674,9386.608],
    ["2017",11515.251,10909.367],
    ["2018",14275.383,14070.804],
    ["2019",14727.604,11446.749]]);
  var options = {
    width: "80%",
    height: 300,
    legend: { position: "right" },
    vAxis: {
      viewWindow: {
        min: 0
      }
    }
  };
  var chart1 = new google.visualization.LineChart(
    document.getElementById("chart1")
  );
  chart1.draw(data, google.charts.Bar.convertOptions(options));
}

function chart2Draw(data) {
  var data = google.visualization.arrayToDataTable(data);
  data.sort({column:1,desc:true});
  var options = {
    width: "100%",
    height: 600,
    sliceVisibilityThreshold: 0.03,
    legend: { position: "right" }
  };
  var chart2 = new google.visualization.PieChart(
    document.getElementById("chart2")
  );
  chart2.draw(data, options);
}

function chart3Draw() {
  var data = google.visualization.arrayToDataTable([
    ["กรมในสังกัด", "ปี 2559", "ปี 2560", "ปี 2561", "ปี 2562"],
    ["กรมวิทยาศาสตร์บริการ", 450.2673, 474.4084, 524.9718, 548.0527],
    [
      "ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)",
      185.0203,
      262.1124,
      382.6407,
      277.7378
    ],
    [
      "สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)",
      538.0941,
      585.7924,
      692.1665,
      832.7698
    ],
    ["สถาบันมาตรวิทยาแห่งชาติ", 0, 0, 725.8701, 480.9013],
    [
      "สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)",
      403.7029,
      440.317,
      507.296,
      450.0019
    ],
    [
      "สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)",
      489.9262,
      475.7811,
      634.1372,
      690.9154
    ],
    [
      "สถาบันสารสนเทศทรัพยากรน้ำและการเกษตร (องค์การมหาชน)",
      329.4583,
      313.3675,
      571.6822,
      376.7581
    ],
    [
      "สำนักงานคณะกรรมการนโยบายวิทยาศาสตร์ เทคโนโลยีและนวัตกรรมแห่งชาติ",
      284.2965,
      310.9639,
      302.4077,
      1145.0097
    ],
    [
      "สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)",
      2849.268,
      202.253,
      341.2518,
      343.6642
    ],
    ["สำนักงานปรมาณูเพื่อสันติ", 3081.0898, 413.5265, 268.3035, 421.3571],
    [
      "สำนักงานปลัดกระทรวงวิทยาศาสตร์และเทคโนโลยี",
      275.3535,
      4042.7563,
      3578.6131,
      3314.1215
    ],
    [
      "สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน)",
      270.6188,
      589.0305,
      1809.4648,
      1388.4254
    ],
    [
      "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ",
      568.5783,
      3404.9416,
      3936.5774,
      4457.8888
    ]
  ]);
  data.sort({column:4, desc:true})
  var chart3 = new google.visualization.BarChart(
    document.getElementById("chart3")
  );
  var options = {
    width: "100%",
    height: 900,
    bars: "horizontal"
  };

  chart3.draw(data, options);
}
